perf/scenarios/load-testing/fact.yaml
config:
  plugins:
    publish-metrics:
      - type: datadog
        apiKey: "{{ $processEnvironment.DATADOG_API_KEY }}"
        apiHost: "us5.datadoghq.com"
        prefix: "artillery."
        tags:
          - "test:load-testing"
          - "api:fact"
          - "env:{{ $environment }}"

  environments:
    base-case:
      target: "{{ $processEnvironment.TARGET }}/fact"
      variables:
        cache: "false"
    cache:
      target: "{{ $processEnvironment.TARGET }}/fact"
      variables:
        cache: "true"
        cacheFillAmount: 100
    rate-limiting:
      target: "{{ $processEnvironment.TARGET }}/limited/fact"
      variables:
        cache: "false"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: warm-up
      duration: 45
      arrivalRate: 10
    - name: ramp-up
      duration: 45
      arrivalRate: 10
      rampTo: 30
    - name: plain
      duration: 90
      arrivalRate: 30

scenarios:
  - name: Useless Facts - Root (/)
    flow:
      - get:
          url: "/"
          qs:
            cache: "{{ cache }}"
            cacheFillAmount: "{{ cacheFillAmount }}"
          headers:
            X-Handle-Guid-Errors: "{{ $processEnvironment.HANDLE_GUID_ERRORS }}"